---
kind: property
id: P:Autodesk.Revit.DB.ACADExportOptions.TargetUnit
source: html/3567c8f2-bef5-6872-5766-d5c633742b35.htm
---
# Autodesk.Revit.DB.ACADExportOptions.TargetUnit Property

The target unit type.
 Default value is ExportUnit.Default.

## Syntax (C#)
```csharp
public ExportUnit TargetUnit { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration